DAMIAN-CHEN/CPKIOT-RA6M5/03_SPI_WS2812/src/hal_entry.c
#include "hal_data.h"
#include "ws2812.h"

FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER

/*******************************************************************************************************************//**
 * @brief Main entry point for the application
 * 
 * This function is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.
 * This function is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* Initialize WS2812 LED control */
    ws_2812_init();

    /* Main application loop */
    while (1) {
        /* Display different color patterns */
        WS2812_Ctrl(0, 0, 10);    /* Blue */
        WS2812_Ctrl(0, 10, 0);    /* Green */
        WS2812_Ctrl(0, 10, 10);   /* Cyan */
        WS2812_Ctrl(10, 0, 0);    /* Red */
        WS2812_Ctrl(10, 0, 10);   /* Magenta */
        WS2812_Ctrl(10, 10, 0);   /* Yellow */
        WS2812_Ctrl(6, 6, 6);     /* White */
        
        /* Turn off all LEDs */
        for (int i = 0; i < 4; ++i) {
            WS2812_Ctrl(0, 0, 0);
        }

        /* Delay between patterns */
        R_BSP_SoftwareDelay(1000, BSP_DELAY_UNITS_MILLISECONDS);
    }

#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * @brief Warm start function
 * 
 * This function is called at various points during the startup process.
 * This implementation uses the event that is called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event) {
#if BSP_FEATURE_FLASH_LP_VERSION != 0
        /* Enable reading from data flash */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery.
         * Placing the enable here, before clock and C runtime initialization,
         * should negate the need for a delay since the initialization will
         * typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event) {
        /* C runtime environment and system clocks are setup */

        /* Configure pins */
        R_IOPORT_Open(&IOPORT_CFG_CTRL, &IOPORT_CFG_NAME);

#if BSP_CFG_SDRAM_ENABLED
        /* Setup SDRAM and initialize it. Must configure pins first */
        R_BSP_SdramInit(true);
#endif
    }
}

#if BSP_TZ_SECURE_BUILD

FSP_CPP_HEADER
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable();

/* Trustzone Secure Projects require at least one nonsecure callable function
 * in order to build (Remove this if it is not required to build) */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable()
{
    /* Empty function for secure build requirements */
}
FSP_CPP_FOOTER

#endif
